


// targil 1
// צרו תוכנית בה המשתמש מזין את אורך צלעותיו של מלבן (2 צלעות) והתוכנית מדפיסה את שטח המלבן, אם שני הצלעות שוות הדפיסו את שטח המלבן בצירוף המילה "square"

// var side = 2
// var side2 = 2

// if(side === side2){
    //     console.log("Squere :"+side*side2)

    // }
    // else {
//     console.log("rectange"+side*side2)
// }

////////////////////////////////////////////////////////////////////////////////////////////////////
//                   targil 2

// צרו תוכנית בה המשתמש מזין את שנת הולדתו והתוכנית מדפיסה לו את גילו בקירוב בהנחה שהשנה היא השנה הנוכחית 2022


// var year = +prompt("enter your birthdate")
// console.log("your age is" +" "+(2022 - year))



//////////////////////////////////////////////////////////////////////////////////////////////////////////

// targil 3 
// צרו תוכנית בה המשתמש מזין 6 פעמים מצרכים ומכניסה אותם לתוך מערך, צרו לולאה שעוברת על המערך ומדפיסה את הפריטים במערך בסדר הפוך.

// var muzarim =[]
// var input = ""

// for (let index = 0; index < 6; index++) {
//     input = prompt("enter myzar")
//     muzarim.push(input)

// }
// console.log(muzarim)
// console.log(muzarim.reverse())


///////////////////////////////////////////////////////////////////////////////////////////////////////////////
//\\\

// targil 4
// צרו תוכנית שמקבלת מהמשתמש מספר מ1 עד 7, המספרים מייצגים את ימות השבוע, אם המשתמש הזין מספר המייצג את יום ראשון עד חמישי, הדפס לקונסול "Workday" אם המספר מייצג את ימי שישי ושבת הדפס לקונסול "Weekend"

// var day =prompt("enter day number")

// if(day>0&&day<6){
//     console.log("work day")
// }
// else if (day == 6|| day ==7){
//     console.log("hofesh")

// }
// else {
//     console.log("please enter day number from 1-7")
// }


///////////////////////////////////////////////////////////////////////////////////////////////////////

// targil 5 
// צרו תוכנית בה אתם מקבלים 6 שמות מהמשתמש והכניסו אותם למערך, הדפיסו רק את השמות במיקום אי זוגי.

var names = []
var input

for (let index = 0; index < 6; index++) {
   names[index]=prompt("enter name")
   if (index % 2){
    console.log("not zugiim names"+names[index])
   }
    
}

